{
    "locales": {
        "en": {
            "title": "Welcome!",
            "title_menu": "About me",
            "title_long_prefix": "Hello...",
            "title_long": "I'm **Mark Garabilez!**"
        },

        "es": {
            "title": "¡Saludos!",
            "title_menu": "Sobre mí",
            "title_long_prefix": "Hola...",
            "title_long": "Soy **Mark Garabilez!**"
        },

        "fr": {
            "title": "Salut !",
            "title_menu": "À propos",
            "title_long_prefix": "Salut...",
            "title_long": "Je suis **Mark Garabilez!**"
        },

        "ko": {
            "title": "환영합니다!",
            "title_menu": "소개",
            "title_long_prefix": "안녕하세요...",
            "title_long": "저는 **Mark Garabilez** 입니다!"
        }
    },

    "articles": [
        {
            "id": "contact_list",
            "component": "ArticleGrid",
            "config": {
                "ignorePaddingTop": true,
                "format": "inline"
            },
            "locales": {
                "en": {},
                "es": {},
                "fr": {},
                "ko": {}
            },

            "items": [
                {
                    "value": "Web Developer",
                    "links": [
                        {"href": null}
                    ],
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-globe",
                        "faColors": {"bg": null, "fill": null}
                    }
                },
                {
                    "value": "garabilezmark0130@gmail.com",
                    "links": [
                        {"href": "mailto:garabilezmark0130@gmail.com"}
                    ],
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-envelope",
                        "faColors": {"bg": null, "fill": null}
                    }
                },
                {
                    "value": "@kkarrma",
                    "links": [
                        {"href": "https://github.com/kkarrma"}
                    ],
                    "icon": {
                        "img": null,
                        "fa": "fa-brands fa-github",
                        "faColors": {"bg": null, "fill": null}
                    }
                }
            ]
        },

        {
            "id": "short_description",
            "component": "ArticleInfoBlock",
            "config": {},
            "locales": {
                "en": {"title": "**A little bit** about me..."},
                "es": {"title": "**Un poco** sobre mí..."},
                "fr": {"title": "**Un peu** à propos de moi..."},
                "ko": {"title": "저에 **대해 조금**..."}
            },

            "items": [
                {
                    "icon": {
                        "img": "images/pictures/sdev.png",
                        "fa": null,
                        "faColors": {"bg": null, "fill": null}
                    },
                    "locales": {
                        "en": {"text": "<p>I'm a <b>fresh IT graduate</b> with a Bachelor of Science in Information Technology, majoring in Web and Mobile Development. I'm passionate about creating responsive, user-friendly websites and applications that deliver exceptional experiences.</p><p>My education and projects have equipped me with skills in both <b>frontend and backend development</b>, allowing me to build complete web solutions from concept to deployment.</p><p>I'm excited to bring my fresh perspective and technical skills to <b>your next project!</b></p>"},
                        "es": {"text": "<p>Soy un <b>recién graduado en TI</b> con una Licenciatura en Ciencias de la Tecnología de la Información, especializado en Desarrollo Web y Móvil. Me apasiona crear sitios web y aplicaciones responsivas y fáciles de usar que ofrezcan experiencias excepcionales.</p><p>Mi educación y proyectos me han dotado de habilidades tanto en <b>desarrollo frontend como backend</b>, permitiéndome construir soluciones web completas desde el concepto hasta la implementación.</p><p>¡Estoy emocionado por aportar mi perspectiva fresca y habilidades técnicas a <b>tu próximo proyecto!</b></p>"},
                        "fr": {"text": "<p>Je suis un <b>jeune diplômé en informatique</b> avec une Licence en Sciences de la Technologie de l'Information, spécialisé en Développement Web et Mobile. Je suis passionné par la création de sites web et d'applications réactifs et conviviaux qui offrent des expériences exceptionnelles.</p><p>Ma formation et mes projets m'ont doté de compétences en <b>développement frontend et backend</b>, me permettant de construire des solutions web complètes de la conception au déploiement.</p><p>Je suis enthousiaste à l'idée d'apporter ma perspective fraîche et mes compétences techniques à <b>votre prochain projet !</b></p>"},
                        "ko": {"text": "<p>저는 웹 및 모바일 개발을 전공한 <b>정보기술학 학사</b> 신규 졸업생입니다. 저는 뛰어난 사용자 경험을 제공하는 반응형 웹사이트와 애플리케이션을 만드는 데 열정을 가지고 있습니다.</p><p>제 교육과 프로젝트를 통해 <b>프론트엔드와 백엔드 개발</b> 모두에 능숙하여, 개념부터 배포까지 완전한 웹 솔루션을 구축할 수 있습니다.</p><p>제 새로운 관점과 기술 능력을 <b>귀하의 다음 프로젝트에</b> 적용하게 되어 기대됩니다!</p>"}
                    }
                }
            ]
        },

        {
            "id": "testimonials",
            "component": "ArticleTestimonials",
            "config": {},
            "locales": {
                "en": {"title": "Client **testimonials**"},
                "es": {"title": "Testimonios de **clientes**"},
                "fr": {"title": "Témoignages de **clients**"},
                "ko": {"title": "**고객** 추천사"}
            },

            "items": [
                {
                    "value": "Anita Bath",
                    "links": [
                        {"href": "https://linkedin.com"}
                    ],
                    "icon": {
                        "img": "images/pictures/person-1.png",
                        "fa": "fa-solid fa-user",
                        "faColors": null
                    },
                    "locales": {
                        "en": {
                            "info": "CEO at <b>SalesForce</b>",
                            "text": "Working with Mark was a transformative experience. His programming skills and dedication not only improved our project but also inspired the entire team."
                        },
                        "es": {
                            "info": "CEO en <b>SalesForce</b>",
                            "text": "Trabajar con Mark fue una experiencia transformadora. Sus habilidades de programación y dedicación no solo mejoraron nuestro proyecto, sino que también inspiraron a todo el equipo."
                        },
                        "fr": {
                            "info": "PDG de <b>SalesForce</b>",
                            "text": "Travailler avec Mark a été une expérience transformative. Ses compétences en programmation et son dévouement ont non seulement amélioré notre projet, mais ont également inspiré toute l'équipe."
                        },
                        "ko": {
                            "info": "세일즈포스  CEO",
                            "text": "Mark와의 협업은 변화를 가져오는 경험이었습니다. 그의 프로그래밍 기술과 헌신은 우리 프로젝트를 개선할 뿐만 아니라 팀 전체에 영감을 주었습니다."
                        }
                    }
                },

                {
                    "value": "Lou Natic",
                    "links": [
                        {"href": "https://github.com"}
                    ],
                    "icon": {
                        "img": "images/pictures/person-3.png",
                        "fa": null,
                        "faColors": {"bg": null, "fill": null}
                    },
                    "locales": {
                        "en": {
                            "info": "Lead Developer at <b>GitHub</b>",
                            "text": "Having Mark on our team was an invaluable asset. His deep programming insights and mentorship not only elevated our projects but also empowered us to tackle every challenge with confidence and creativity."
                        },
                        "es": {
                            "info": "Desarrollador Principal en <b>GitHub </b>",
                            "text": "Tener a Mark en nuestro equipo fue un activo invaluable. Sus profundas ideas sobre programación y su mentoría no solo elevaron nuestros proyectos, sino que también nos empoderaron para enfrentar cada desafío con confianza."
                        },
                        "fr": {
                            "info": "Développeur Principal chez <b>GitHub </b>",
                            "text": "Avoir Mark dans notre équipe a été un atout inestimable. Ses connaissances approfondies en programmation et son mentorat ont non seulement élevé nos projets, mais nous ont également permis de relever chaque défi avec confiance."
                        },
                        "ko": {
                            "info": "<b>GitHub</b> 수석 개발자",
                            "text": "우리 팀에 Mark가 있다는 것은 귀중한 자산이었습니다. 그의 깊은 프로그래밍 통찰력과 멘토링은 우리의 프로젝트를 높이고 모든 도전에 자신감과 창의성으로 대응할 수 있게 해주었습니다."
                        }
                    }
                },

                {
                    "value": "Paige Turner",
                    "links": [
                        {"href": null}
                    ],
                    "icon": {
                        "img": "images/pictures/person-2.png",
                        "fa": null,
                        "faColors": {"bg": null, "fill": null}
                    },
                    "locales": {
                        "en": {
                            "info": "Managing Director at <b>Dingga</b>",
                            "text": "Collaborating with Mark was a game changer for our development process. His expertise and problem-solving abilities were invaluable to our success."
                        },
                        "es": {
                            "info": "Directora General en <b>Dingga</b>",
                            "text": "Colaborar con Mark fue un cambio de juego para nuestro proceso de desarrollo. Su experiencia y habilidades para resolver problemas fueron invaluables para nuestro éxito."
                        },
                        "fr": {
                            "info": "Directrice Générale chez <b>Dingga</b>",
                            "text": "Collaborer avec Mark a été un tournant pour notre processus de développement. Son expertise et ses capacités à résoudre des problèmes ont été inestimables pour notre succès."
                        },
                        "ko": {
                            "info": "딩가 전무이사",
                            "text": "Mark와의 협업은 우리의 개발 프로세스에 혁신을 가져왔습니다. 그의 전문성과 문제 해결 능력은 우리의 성공에 없어서는 안 될 요소였습니다."
                        }
                    }
                },

                {
                    "value": "Chris P. Bacon",
                    "links": [
                        {"href": "https://dribbble.com"}
                    ],
                    "icon": {
                        "img": "images/pictures/person-4.png",
                        "fa": null,
                        "faColors": {"bg": null, "fill": null}
                    },
                    "locales": {
                        "en": {
                            "info": "Creative Director at <b>Dribbble</b>",
                            "text": "Mark's attention to detail and his innovative thinking brought a fresh perspective to our design process. He truly elevated our team's work and helped us deliver results beyond expectations."
                        },
                        "es": {
                            "info": "Directora Creativa en <b>Dribbble</b>",
                            "text": "La atención al detalle de Mark y su pensamiento innovador aportaron una nueva perspectiva a nuestro proceso de diseño. Realmente elevó el trabajo de nuestro equipo y nos ayudó a ofrecer resultados más allá de lo esperado."
                        },
                        "fr": {
                            "info": "Directrice Créative chez <b>Dribbble</b>",
                            "text": "L'attention aux détails de Mark et sa pensée innovante ont apporté une nouvelle perspective à notre processus de design. Il a véritablement élevé le travail de notre équipe et nous a aidés à livrer des résultats au-delà des attentes."
                        },
                        "ko": {
                            "info": "<b>Dribbble</b> 크리에이티브 디렉터",
                            "text": "Mark의 세부 사항에 대한 주의와 혁신적인 사고는 우리 디자인 프로세스에 신선한 관점을 제공했습니다. 그는 팀의 작업을 향상시키고 기대 이상의 결과를 제공하는 데 큰 도움을 주었습니다."
                        }
                    }
                }
            ]
        },

        {
            "id": "interests",
            "component": "ArticleGrid",
            "config": {
                "format": "grid"
            },
            "locales": {
                "en": {"title": "Soft **skills**"},
                "es": { "title": "Habilidades **blandas**" },
                "fr": { "title": "Compétences **transversales** " },
                "ko": { "title": "소프트 **스킬**" }
            },

            "items": [
    {
        "icon": {
            "img": null,
            "fa": "fa-solid fa-comments",
            "faColors": null
        },
        "value": null,
        "locales": {
            "en": {
                "title": "Communication",
                "info": "Clearly conveying technical concepts to both technical and non-technical stakeholders."
            },
            "es": {
                "title": "Comunicación",
                "info": "Transmitir claramente conceptos técnicos tanto a partes interesadas técnicas como no técnicas."
            },
            "fr": {
                "title": "Communication",
                "info": "Communiquer clairement des concepts techniques aux parties prenantes techniques et non techniques."
            },
            "ko": {
                "title": "의사소통",
                "info": "기술적 및 비기술적 이해관계자 모두에게 기술 개념을 명확히 전달하기."
            }
        }
    },

    {
        "icon": {
            "img": null,
            "fa": "fa-solid fa-users",
            "faColors": null
        },
        "value": null,
        "locales": {
            "en": {
                "title": "Collaboration",
                "info": "Working effectively with designers, developers, and project managers."
            },
            "es": {
                "title": "Colaboración",
                "info": "Trabajar eficazmente con diseñadores, desarrolladores y gerentes de proyectos."
            },
            "fr": {
                "title": "Collaboration",
                "info": "Travailler efficacement avec les designers, les développeurs et les chefs de projet."
            },
            "ko": {
                "title": "협업",
                "info": "디자이너, 개발자 및 프로젝트 관리자와 효과적으로 협력하기."
            }
        }
    },

    {
        "icon": {
            "img": null,
            "fa": "fa-solid fa-lightbulb",
            "faColors": null
        },
        "value": null,
        "locales": {
            "en": {
                "title": "Problem Solving",
                "info": "Analyzing complex issues and developing efficient, creative solutions."
            },
            "es": {
                "title": "Resolución de problemas",
                "info": "Analizar problemas complejos y desarrollar soluciones eficientes y creativas."
            },
            "fr": {
                "title": "Résolution de problèmes",
                "info": "Analyser des problèmes complexes et développer des solutions efficaces et créatives."
            },
            "ko": {
                "title": "문제 해결",
                "info": "복잡한 문제를 분석하고 효율적이고 창의적인 해결책 개발하기."
            }
        }
    },

    {
        "icon": {
            "img": null,
            "fa": "fa-solid fa-clock",
            "faColors": null
        },
        "value": null,
        "locales": {
            "en": {
                "title": "Time Management",
                "info": "Prioritizing tasks and meeting deadlines in fast-paced development environments."
            },
            "es": {
                "title": "Gestión del tiempo",
                "info": "Priorizar tareas y cumplir plazos en entornos de desarrollo de ritmo rápido."
            },
            "fr": {
                "title": "Gestion du temps",
                "info": "Prioriser les tâches et respecter les délais dans des environnements de développement rapides."
            },
            "ko": {
                "title": "시간 관리",
                "info": "빠르게 변화하는 개발 환경에서 작업의 우선순위를 정하고 기한 맞추기."
            }
        }
    },

    {
        "icon": {
            "img": null,
            "fa": "fa-solid fa-book",
            "faColors": null
        },
        "value": null,
        "locales": {
            "en": {
                "title": "Continuous Learning",
                "info": "Staying updated with new technologies and industry best practices."
            },
            "es": {
                "title": "Aprendizaje continuo",
                "info": "Mantenerse actualizado con nuevas tecnologías y mejores prácticas de la industria."
            },
            "fr": {
                "title": "Apprentissage continu",
                "info": "Rester à jour avec les nouvelles technologies et les meilleures pratiques du secteur."
            },
            "ko": {
                "title": "지속적 학습",
                "info": "새로운 기술과 업계 모범 사례를 지속적으로 습득하기."
            }
        }
    },

    {
        "icon": {
            "img": null,
            "fa": "fa-solid fa-eye",
            "faColors": null
        },
        "value": null,
        "locales": {
            "en": {
                "title": "Attention to Detail",
                "info": "Catching small errors and ensuring code quality and consistency."
            },
            "es": {
                "title": "Atención al detalle",
                "info": "Detectar pequeños errores y garantizar la calidad y consistencia del código."
            },
            "fr": {
                "title": "Souci du détail",
                "info": "Repérer les petites erreurs et assurer la qualité et la cohérence du code."
            },
            "ko": {
                "title": "세부 사항에 대한 주의",
                "info": "작은 오류를 포착하고 코드 품질과 일관성 보장하기."
            }
        }
    }
]
        }
    ]
}
